# %%
# ==============================================================================
# 1. ИМПОРТЫ (исправленный datetime)
# ==============================================================================
import os
from models.lstm_gcn_net import *



# %%
# ==============================================================================
# 5. ЗАПУСК
# ==============================================================================
if __name__ == "__main__":
    # Создаем директории
    os.makedirs('models', exist_ok=True)
    os.makedirs('runs', exist_ok=True)

    # Пример использования
    model = LSTMSkeletonNet(num_classes=60)
    model.train_model('lstm_params.yml')